STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_Long_Range_Central/STM32_WPAN/App/app_ble.c
static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_EVENT_PROC_GAP_COMPLETE);
  return;
}

/**
  * @brief  Notify the LL to resume the flow process
  * @param  None
  * @retval None
  */
static void BLE_ResumeFlowProcessCallback(void)
{
  /* Receive any events from the LL. */
  change_state_options_t notify_options;

  notify_options.combined_value = 0x0F;

  ll_intf_chng_evnt_hndlr_state( notify_options );
}

static void BLE_NvmCallback(SNVMA_Callback_Status_t CbkStatus)
{
  if (CbkStatus != SNVMA_OPERATION_COMPLETE)
  {
    /* Retry the write operation */
    SNVMA_Write (APP_BLE_NvmBuffer, BLE_NvmCallback);
  }
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */
static uint8_t analyse_ext_adv_report(hci_le_extended_advertising_report_event_rp0 *p_ext_adv_report)
{
  uint8_t status;
  
  if ((display_filter != 0) && HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0010))
  {
    status = 1;
  }
  else
  {
    status = 0;
    
    l_buff_pos = 0;
    memset(&l_buff[l_buff_pos], 0, L_BUFF_SIZE);          

    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, 
                            "%02X:%02X:%02X:%02X:%02X:%02X | "
                            ,p_ext_adv_report->Address[5], p_ext_adv_report->Address[4]
                            ,p_ext_adv_report->Address[3] ,p_ext_adv_report->Address[2]
                            ,p_ext_adv_report->Address[1] ,p_ext_adv_report->Address[0]);
   
    if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0010))
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE, "LEGACY   |");
    }
    else
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE, "EXTENDED |");
    }
    
    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%4d | ",(int8_t)p_ext_adv_report->RSSI );
              
    if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0001))
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "CONN |");
    }
    else
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "     |");
    }
    
    if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0002))
    {
      if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0008))
      {
        l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "SCAN RSP |");
      }
      else
      {
        l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "SCAN     |");
      }
    }
    else
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "         |");
    }
    
    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%3d | ",p_ext_adv_report->Data_Length );
    
    if (p_ext_adv_report->Advertising_SID != 0xFF)
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "%2d | ",p_ext_adv_report->Advertising_SID );
    }
    
    if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0020))
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "more data   | ");
    }
    else if (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0040))
    {
      l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "trunc data | ");
    }
    else
    {
      /* Nothing to do */
    }          

    if( !(HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0010)) && /* extended */
        (HAL_IS_BIT_SET(p_ext_adv_report->Event_Type, 0x0001)) )   /* connectable */
    {
      uint8_t i, adtype, adlength;
      
      i = 0;
      while ( i < p_ext_adv_report->Data_Length )
      {
        adlength = p_ext_adv_report->Data[i];
        adtype = p_ext_adv_report->Data[i + 1];
        
        if ( adtype == AD_TYPE_MANUFACTURER_SPECIFIC_DATA )
        {
          if ( (adlength >= 7) && 
               (p_ext_adv_report->Data[i + 4] == 0x02) && /* blueST v2*/
               (p_ext_adv_report->Data[i + 6] == FW_ID_P2P_SERVER_LONG_RANGE))   /* p2pServer Long Range application */
          {
            l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "Long Range p2pServer detected, address recorded to connect. | ");

            bleAppContext.a_deviceServerExtendedBdAddr[0] = p_ext_adv_report->Address[0];
            bleAppContext.a_deviceServerExtendedBdAddr[1] = p_ext_adv_report->Address[1];
            bleAppContext.a_deviceServerExtendedBdAddr[2] = p_ext_adv_report->Address[2];
            bleAppContext.a_deviceServerExtendedBdAddr[3] = p_ext_adv_report->Address[3];
            bleAppContext.a_deviceServerExtendedBdAddr[4] = p_ext_adv_report->Address[4];
            bleAppContext.a_deviceServerExtendedBdAddr[5] = p_ext_adv_report->Address[5];
            bleAppContext.deviceServerExtendedAddressType = p_ext_adv_report->Address_Type;
            
            APP_DBG_MSG("     - Found Device @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      bleAppContext.a_deviceServerExtendedBdAddr[5],
                      bleAppContext.a_deviceServerExtendedBdAddr[4],
                      bleAppContext.a_deviceServerExtendedBdAddr[3],
                      bleAppContext.a_deviceServerExtendedBdAddr[2],
                      bleAppContext.a_deviceServerExtendedBdAddr[1],
                      bleAppContext.a_deviceServerExtendedBdAddr[0]);
            
            APP_DBG_MSG("Address type %d",bleAppContext.deviceServerExtendedAddressType);
            
            APP_BSP_LED_On(LED_BLUE);

            bleAppContext.deviceServerFound = 0x01;
            if (bleAppContext.deviceServerFound == 1)
              aci_gap_terminate_gap_proc(GAP_GENERAL_DISCOVERY_PROC);
          }
        }
        i += adlength + 1;
      }
    }

    l_buff_pos += snprintf(&l_buff[l_buff_pos], L_BUFF_SIZE - l_buff_pos, "\n");
   
    APP_DBG_MSG("%s",l_buff);
  }
    
  return status;
}

static void connectRequestExt(void)
{
  tBleStatus result;
  Init_Param_Phy_t Init_Param_Phy[3];
  Init_Param_Phy[0].Scan_Interval       = SCAN_INT_MS(500);
  Init_Param_Phy[0].Scan_Window         = SCAN_WIN_MS(500);
  Init_Param_Phy[0].Conn_Interval_Min   = CONN_INT_MS(7.5);
  Init_Param_Phy[0].Conn_Interval_Max   = CONN_INT_MS(7.5);
  Init_Param_Phy[0].Conn_Latency        = 0;
  Init_Param_Phy[0].Supervision_Timeout = CONN_SUP_TIMEOUT_MS(5000);
  Init_Param_Phy[0].Min_CE_Length       = CONN_CE_LENGTH_MS(10);
  Init_Param_Phy[0].Max_CE_Length       = CONN_CE_LENGTH_MS(10);

  APP_BSP_LED_Off(LED_BLUE);
  if (bleAppContext.deviceServerFound != 0x00)
  {
    APP_DBG_MSG("aci_gap_ext_create_connection\n");
    
    APP_DBG_MSG("     - Found Device @:%02x:%02x:%02x:%02x:%02x:%02x\n",
                      bleAppContext.a_deviceServerExtendedBdAddr[5],
                      bleAppContext.a_deviceServerExtendedBdAddr[4],
                      bleAppContext.a_deviceServerExtendedBdAddr[3],
                      bleAppContext.a_deviceServerExtendedBdAddr[2],
                      bleAppContext.a_deviceServerExtendedBdAddr[1],
                      bleAppContext.a_deviceServerExtendedBdAddr[0]);

    result = aci_gap_ext_create_connection(0x00, GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC,
                                       CFG_BD_ADDRESS_TYPE,
                                       bleAppContext.deviceServerExtendedAddressType, 
                                       &bleAppContext.a_deviceServerExtendedBdAddr[0],
                                       0xFF, 0xFF, 0,
                                       HCI_INIT_PHYS_SCAN_CONN_LE_CODED,
                                       Init_Param_Phy);
    
    if (result == BLE_STATUS_SUCCESS)
    {
      bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
    }
    else
    {
      APP_DBG_MSG("==>> GAP Ext Create connection Failed , result: 0x%02x\n", result);
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }
  }

  return;
}

