STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_Long_Range_Central/STM32_WPAN/App/app_ble.c
uint8_t connection_update(void)
{
  tBleStatus result;
  Init_Param_Phy_t Init_Param_Phy[3];
  Init_Param_Phy[0].Scan_Interval       = SCAN_INT_MS(500);
  Init_Param_Phy[0].Scan_Window         = SCAN_WIN_MS(500);
  Init_Param_Phy[0].Conn_Interval_Min   = CONN_INT_MS(50);
  Init_Param_Phy[0].Conn_Interval_Max   = CONN_INT_MS(50);
  Init_Param_Phy[0].Conn_Latency        = 0;
  Init_Param_Phy[0].Supervision_Timeout = CONN_SUP_TIMEOUT_MS(5000);
  Init_Param_Phy[0].Min_CE_Length       = CONN_CE_LENGTH_MS(10);
  Init_Param_Phy[0].Max_CE_Length       = CONN_CE_LENGTH_MS(10);
  
  result = aci_gap_start_connection_update(bleAppContext.connectionHandle,
                                           Init_Param_Phy[0].Conn_Interval_Min, Init_Param_Phy[0].Conn_Interval_Max,
                                           Init_Param_Phy[0].Conn_Latency,
                                           Init_Param_Phy[0].Supervision_Timeout,
                                           Init_Param_Phy[0].Min_CE_Length, Init_Param_Phy[0].Max_CE_Length);
  if (result == BLE_STATUS_SUCCESS)
  {
  }
  else
  {
    APP_DBG_MSG("==>> connection update Failed , result: 0x%02x\n", result);
  }
  
  return result;
}

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

/**
  * @brief Callback called by the BLE stack (from BleStack_Process() context)
  * to send an indication to the application. The indication is a BLE standard
  * packet that can be either an ACI/HCI event or an ACL data.
  * @param data: pointer to the data of the packet
  * @param length: length of the data of the packet
  * @param ext_data: pointer to the extended data
  * @param ext_length: extended data length
  * @retval Status of the operation
  */

tBleStatus BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = BLE_STATUS_FAILED;
  BleEvtPacket_t *phcievt = NULL;
  uint16_t total_length = (length+ext_length);

  UNUSED(ext_data);

  /* USER CODE BEGIN BLECB_Indication */

  /* USER CODE END BLECB_Indication */

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    BLE_EVENTS_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_BLE_EVENTS,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &BLE_EVENTS_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      MEMCPY( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

static void Disconnection_request(void)
{
  tBleStatus ret;
  ret = aci_gap_terminate(bleAppContext.connectionHandle,HCI_REMOTE_USER_TERMINATED_CONNECTION_ERR_CODE);
  
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gap_terminate() Failed, ret 0x%02X\n",ret);
  }
  else
  {
    APP_DBG_MSG("aci_gap_terminate(), Successfully\n");
    APP_DBG_MSG("  End of test\n");
  }
}

#if (CFG_BUTTON_SUPPORTED == 1)
void APP_BSP_Button1Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    if (scan_running == 1)
    {
      APP_BLE_Procedure_Gap_Central_Ext(PROC_GAP_CENTRAL_SCAN_EXT_TERMINATE);
      scan_running = 0;
    }
    else
    {
      APP_BLE_Procedure_Gap_Central_Ext(PROC_GAP_CENTRAL_SCAN_EXT_START);
      scan_running = 1;
    }
  }
  else
  {
    UTIL_SEQ_SetTask( 1u << CFG_TASK_P2PC_WRITE_CHAR_ID, CFG_SEQ_PRIO_0);
  }

  return;
}

void APP_BSP_Button2Action(void)
{  
  toggle_flag = !toggle_flag;
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
  }
  else
  {
    APP_BLE_Procedure_Gap_General(PROC_GAP_GEN_LE_CODED_PHY_TOGGLE);
  }
  return;
}

#endif

static void Switch_OFF_GPIO(void *arg)
{
  APP_BSP_LED_Off(LED_GREEN);
  return;
}
/* USER CODE END FD_WRAP_FUNCTIONS */
